// 2. 表达式计算（支持空格，连乘，连除）
// 【问题描述】

// 从标准输入中读入一个整数算术运算表达式，如5 - 1 * 2 * 3 + 12 / 2 / 2  = 。计算表达式结果，并输出。

// 要求：
// 1、表达式运算符只有+、-、*、/，表达式末尾的’=’字符表示表达式输入结束，表达式中可能会出现空格；
// 2、表达式中不含圆括号，不会出现错误的表达式；
// 3、出现除号/时，以整数相除进行运算，结果仍为整数，例如：5/3结果应为1。

// 【输入形式】

// 在控制台中输入一个以’=’结尾的整数算术运算表达式。

// 【输出形式】

// 向控制台输出计算结果（为整数）。

// 【样例1输入】

// 5 - 1 * 2 * 3 + 12 / 2 / 2  =

// 【样例1输出】

// 2

// 【样例2输入】

// 500 =

// 【样例2输出】

// 500

// 【样例1说明】

// 输入的表达式为5 - 1 * 2 * 3 + 12 / 2 / 2 =，按照整数运算规则，计算结果为2，故输出2。

// 【样例2说明】

// 输入的表达式为500 = ，没有运算符参与运算，故直接输出500。

// 算法之一提示：
// 1、可以利用gets函数，读取整行表达式；
// 2、对于空格，可以考虑首先去除表达式中的所有空格
// 3、可以设一计数器用来记录已读取、但未参加运算的运算符的个数，根据该计数器来判断如何进行运算；
// 4、可以设计一函数：实现二元整数算术运算。

// 【评分标准】

// 该题要求输出整数表达式的计算结果，共有5个测试点。上传C语言文件名为example1c.c。
#include<stdio.h>
int number_change(int num,char digit){
    num=10*num+digit-'0';
    return num;
}
int main(){
    char str1[200];
    int str2[3][200]={},str3[2][200]={};//str2中0对储存数字进行转化,1记录该数字后的符号，2为该处几个乘号
    gets(str1);
    int i,final=0,j=0,k=0,num1=0,num2,mult_num;
    for(i=0,j=0;str1[i]!='=';i++){
        if(str1[i]!=' '){
            if(str1[i]>='0'&&str1[i]<='9'){
                str2[0][j]=number_change(str2[0][j],str1[i]);
            }
            else {
                switch(str1[i]){
                    case '+':str2[1][j]=0;num1=0;break;
                    case '-':str2[1][j]=1;num1=0;break;
                    case '*':str2[1][j]=2;num1++;break;
                    case '/':str2[1][j]=3;num1++;break;
                }
                j++;
                str2[2][j-num1]=num1;
            }
        }
    }
    if(j==0)final=str2[0][0];//不存在运算符号时
    else if(j==1&&str2[0][0]==0){
        if(str2[1][0]==0){
            final=str2[0][1];
        }
        else final-=str2[0][1];
    }
    else{
        for(i=0,num2=0;i<=j;i++){
            if(str2[1][i]==2||str2[1][i]==3){
                mult_num=str2[0][i];
                for(k=0;k<str2[2][i];k++){
                    if(str2[1][i+k]==2){
                        mult_num*=str2[0][i+k+1];
                    }
                    else if(str2[1][i+k]==3){
                        mult_num/=str2[0][i+k+1];
                    }
                }
                i+=str2[2][i];
                str3[0][num2]=mult_num;
                str3[1][num2++]=str2[1][i];
            }
            else{
                str3[0][num2]=str2[0][i];
                str3[1][num2++]=str2[1][i];
            }
        }//通过对运算符号的个数来看
        final=str3[0][0];
        for(i=0;i<num2-1;i++){
            if(str3[1][i]==0){
                final+=str3[0][i+1];
            }
            else{
                final-=str3[0][i+1];
            }
        }
    }
    printf("%d",final);
    return 0;
}

